# # SQLite Basics

## 1. Introduction

In this notebook, we will explore the basics of working with SQLite, a lightweight relational database, using Python. We'll cover how to create a database, execute basic SQL commands, and interact with the database using Python's `sqlite3` module. This time, we'll focus on storing users' names, ages, and hair colors.

## 2. Importing the SQLite Library

In [43]:
import sqlite3
import pandas as pd

## 3. Creating a New SQLite Database

In [45]:
# Connecting to SQLite (creates the database if it doesn't exist)
conn = sqlite3.connect('data/example.db')

# Creating a cursor object to interact with the database
cursor = conn.cursor()

## 4. Creating a Table

In [47]:
# Creating a table named 'users'
cursor.execute('''CREATE TABLE IF NOT EXISTS users
                  (id INTEGER PRIMARY KEY AUTOINCREMENT,
                   name TEXT,
                   age INTEGER,
                   haircolor TEXT)''')

# Commit the changes
conn.commit()

## 5. Inserting Data into the Table

In [49]:
# Inserting a single record into the 'users' table
cursor.execute("INSERT INTO users (name, age, haircolor) VALUES ('Alice', 25, 'Blonde')")

# Inserting multiple records at once
users = [
    ('Heli', 20, 'Brown'),
    ('Fifi', 25, 'Black'),
    ('Juulia', 30, 'Gray')
]

cursor.executemany("INSERT INTO users (name, age, haircolor) VALUES (?, ?, ?)", users)

# Commit the changes
conn.commit()

## 6. Querying Data from the Table

In [51]:
# Querying all records from the 'users' table
cursor.execute("SELECT * FROM users")

# Fetching all results
rows = cursor.fetchall()

# Displaying the results
for row in rows:
    print(row)

(1, 'Alice', 26, 'Blonde')
(2, 'Bob', 30, 'Brown')
(3, 'Charlie', 35, 'Black')
(5, 'Alice', 25, 'Blonde')
(6, 'Heli', 20, 'Brown')
(7, 'Fifi', 25, 'Black')
(8, 'Juulia', 30, 'Gray')

## 7. Updating Records

In [53]:
# Updating a user's information
cursor.execute("UPDATE users SET age = 26 WHERE name = 'Alice'")

# Commit the changes
conn.commit()

## 8. Deleting Records

In [55]:
# Deleting a user from the table
cursor.execute("DELETE FROM users WHERE name = 'David'")

# Commit the changes
conn.commit()

## 9. Using SQL with Pandas

In [57]:
# Reading from the database into a Pandas DataFrame
df = pd.read_sql_query("SELECT * FROM users", conn)

# Displaying the DataFrame
df.head()

   id     name  age haircolor
0   1    Alice   26    Blonde
1   2      Bob   30     Brown
2   3  Charlie   35     Black
3   5    Alice   26    Blonde
4   6     Heli   20     Brown

## 10. Closing the Connection

In [59]:
# Closing the connection to the database
conn.close()

## 11. Conclusion

In this notebook, we covered the basics of working with SQLite using Python. We learned how to create a database, create tables, insert and query data, and even use SQL queries within a Pandas DataFrame. Instead of email, we used a `haircolor` attribute to manage users' data. SQLite is a powerful tool for small-scale database management, and this notebook provides a solid foundation for further exploration.